# Исходный список чисел
a = [112, 3332, 3345, 654, 678, 997, 657, 789, 887, 998]

# Вывод исходного списка
print("Исходный список:", a)

# Нахождение и вывод максимального значения в списке
print("Максимальное значение:", max(a))

# Нахождение и вывод минимального значения в списке
print("Минимальное значение:", min(a))

# Вычисление и вывод суммы всех элементов списка
print("Сумма элементов:", sum(a))

# Сортировка списка по возрастанию
a.sort()

# Вывод отсортированного списка
print("Отсортированный список:", a)
